Tekla Open API Reference for Tekla Structures 2025
LoftedPlateOperationException Constructor
 Constructs an instance of the class
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LoftedPlateOperationException(
	string message
)
Public Sub New (
	message As String
)
Parameters
message
Type: System.String
Exception message
See Also
Reference
LoftedPlateOperationException Class
Tekla.Structures.Model Namespace